backend/app/controllers/api/v1/notes_controller.rb

  def index
    @notes = Note.order(created_at: :desc)
---
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC

  def create
    @note = Note.new(note_params)
    if @note.save
---
INSERT INTO "notes" ("title", "content", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asfasd"], ["content", "asfas"], ["date", "Monday"], ["created_at", "2019-12-06 06:57:01.314856"], ["updated_at", "2019-12-06 06:57:01.314856"]]

  def update
    @note.update(note_params)
---
UPDATE "notes" SET "title" = $1, "content" = $2, "date" = $3, "updated_at" = $4 WHERE "notes"."id" = $5  [["title", "gegrg"], ["content", "egewrg"], ["date", "Wednesday"], ["updated_at", "2019-12-10 02:09:02.974317"], ["id", 174]]